[
  "PAGE 1",
  "Huynh Quoc Bao - Backend Developer",
  "District 12, Ho Chi Minh City",
  " 0905015627  quocbao64.dev@gmail.com  https://www.linkedin.com/in/quocbao64",
  "OBJECTIVE",
  "A dedicated Backend Developer with practical experience in Golang, Docker, and AWS, seeking to build",
  "high-performance, scalable systems. My goal is to contribute to optimal software architecture while",
  "progressively mastering infrastructure and automation to transition into a professional DevOps Engineer",
  "role.",
  "SKILLS",
  "TECHNICAL SKILLS - Programming/Frameworks: Javascript (React, Node.js), HTML, CSS,",
  "Golang",
  "- Databases: MySQL, PostgreSQL",
  "- Techniques/Tools: Figma, GoLand, Postman, Docker, Jira",
  "- Cloud Platforms: AWS",
  "- Version Control Systems: Git (GitHub, Gitlab)",
  "- Testing: Go Test",
  "OTHER SKILLS - Problem-solving",
  "- Algorithm",
  "- Self-learning",
  "WORK EXPERIENCE",
  "❖ Bach Khoa Technology 06/2024 - Present",
  "Backend Developer",
  "Integrated secure digital signature services (VNPT, Viettel, BKAV,...) using ASP.NET and",
  "orchestrated deployment on IIS, ensuring legal compliance for digital academic transcripts.",
  "Implemented Immudb to architect an immutable ledger for academic records, guaranteeing 100%",
  "data integrity and traceability against unauthorized modifications.",
  "Developed an automated background service using C# and Python to parse exam questions from",
  "uploaded files and integrate with Mathpix API for content digitization.",
  "Refactored and optimized critical RESTful APIs and database queries, successfully reducing system",
  "response times by 60% for the E-learning platform.",
  "Established comprehensive Unit Testing standards using Go Test to validate core business logic,",
  "ensuring code reliability and preventing regressions.",
  "Tech Stack: Golang, Gin, .NET 8, Python, Docker, Redis, Kafka, AWS, MySQL.",
  "❖ Chitta Company 04/2021 - 10/2021",
  "Intern Front-End",
  "Developed the responsive user interface for the real estate trading platform using React.js and",
  "Redux, ensuring seamless state management across complex listing pages.",
  "Successfully integrated Google Maps API to enable interactive property visualization, allowing users",
  "to explore locations and nearby amenities dynamically.",
  "Collaborated with the backend team to integrate RESTful APIs using Axios, ensuring accurate data",
  "rendering and handling technical requirements for data flow.",
  "Tech Stack: React.js, Redux, Reactstrap, SCSS, Axios, Google Maps API.",
  "CERTIFICATIONS",
  "AWS Cloud Technical Essentials Certificate (Coursera) 2023",
  "ICPC-2020 Regionals Certificate 2020",
  "HONORS & AWARDS",
  "First prize in the Young Scientist Challenge at the Industrial University of Ho Chi 2022",
  "Minh City",
  "First prize in the Vietnam Student Olympiad in Informatics 2020",
  "First prize in the City-level Computer Science Competition for Excellent Students 2020",
  "PAGE 2",
  "EDUCATION",
  "❖ Industrial University of Ho Chi Minh City 2020 - Present",
  "Major: Software Engineer"
]